{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "efficientnet-b6_input"}}, {"class_name": "Functional", "config": {"name": "efficientnet-b6", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "stem_conv", "trainable": true, "dtype": "float32", "filters": 56, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_conv", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_bn", "inbound_nodes": [[["stem_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stem_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "stem_activation", "inbound_nodes": [[["stem_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block1a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block1a_dwconv", "inbound_nodes": [[["stem_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1a_bn", "inbound_nodes": [[["block1a_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block1a_activation", "inbound_nodes": [[["block1a_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block1a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block1a_se_squeeze", "inbound_nodes": [[["block1a_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block1a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 56]}, "name": "block1a_se_reshape", "inbound_nodes": [[["block1a_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_se_reduce", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_se_reduce", "inbound_nodes": [[["block1a_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_se_expand", "trainable": true, "dtype": "float32", "filters": 56, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_se_expand", "inbound_nodes": [[["block1a_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block1a_se_excite", "trainable": true, "dtype": "float32"}, "name": "block1a_se_excite", "inbound_nodes": [[["block1a_activation", 0, 0, {}], ["block1a_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_project_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_project_conv", "inbound_nodes": [[["block1a_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1a_project_bn", "inbound_nodes": [[["block1a_project_conv", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block1b_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block1b_dwconv", "inbound_nodes": [[["block1a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1b_bn", "inbound_nodes": [[["block1b_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1b_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block1b_activation", "inbound_nodes": [[["block1b_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block1b_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block1b_se_squeeze", "inbound_nodes": [[["block1b_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block1b_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 32]}, "name": "block1b_se_reshape", "inbound_nodes": [[["block1b_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1b_se_reduce", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1b_se_reduce", "inbound_nodes": [[["block1b_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1b_se_expand", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1b_se_expand", "inbound_nodes": [[["block1b_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block1b_se_excite", "trainable": true, "dtype": "float32"}, "name": "block1b_se_excite", "inbound_nodes": [[["block1b_activation", 0, 0, {}], ["block1b_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1b_project_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1b_project_conv", "inbound_nodes": [[["block1b_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1b_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1b_project_bn", "inbound_nodes": [[["block1b_project_conv", 0, 0, {}]]]}, {"class_name": "FixedDropout", "config": {"name": "block1b_drop", "trainable": true, "dtype": "float32", "rate": 0.0125, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block1b_drop", "inbound_nodes": [[["block1b_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block1b_add", "trainable": true, "dtype": "float32"}, "name": "block1b_add", "inbound_nodes": [[["block1b_drop", 0, 0, {}], ["block1a_project_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block1c_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block1c_dwconv", "inbound_nodes": [[["block1b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1c_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1c_bn", "inbound_nodes": [[["block1c_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1c_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block1c_activation", "inbound_nodes": [[["block1c_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block1c_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block1c_se_squeeze", "inbound_nodes": [[["block1c_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block1c_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 32]}, "name": "block1c_se_reshape", "inbound_nodes": [[["block1c_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1c_se_reduce", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1c_se_reduce", "inbound_nodes": [[["block1c_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1c_se_expand", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1c_se_expand", "inbound_nodes": [[["block1c_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block1c_se_excite", "trainable": true, "dtype": "float32"}, "name": "block1c_se_excite", "inbound_nodes": [[["block1c_activation", 0, 0, {}], ["block1c_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1c_project_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1c_project_conv", "inbound_nodes": [[["block1c_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1c_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1c_project_bn", "inbound_nodes": [[["block1c_project_conv", 0, 0, {}]]]}, {"class_name": "FixedDropout", "config": {"name": "block1c_drop", "trainable": true, "dtype": "float32", "rate": 0.025, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block1c_drop", "inbound_nodes": [[["block1c_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block1c_add", "trainable": true, "dtype": "float32"}, "name": "block1c_add", "inbound_nodes": [[["block1c_drop", 0, 0, {}], ["block1b_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_expand_conv", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_expand_conv", "inbound_nodes": [[["block1c_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_expand_bn", "inbound_nodes": [[["block2a_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2a_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2a_expand_activation", "inbound_nodes": [[["block2a_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2a_dwconv", "inbound_nodes": [[["block2a_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_bn", "inbound_nodes": [[["block2a_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2a_activation", "inbound_nodes": [[["block2a_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block2a_se_squeeze", "inbound_nodes": [[["block2a_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 192]}, "name": "block2a_se_reshape", "inbound_nodes": [[["block2a_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_se_reduce", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_se_reduce", "inbound_nodes": [[["block2a_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_se_expand", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_se_expand", "inbound_nodes": [[["block2a_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2a_se_excite", "trainable": true, "dtype": "float32"}, "name": "block2a_se_excite", "inbound_nodes": [[["block2a_activation", 0, 0, {}], ["block2a_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_project_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_project_conv", "inbound_nodes": [[["block2a_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_project_bn", "inbound_nodes": [[["block2a_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_expand_conv", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_expand_conv", "inbound_nodes": [[["block2a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_expand_bn", "inbound_nodes": [[["block2b_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2b_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2b_expand_activation", "inbound_nodes": [[["block2b_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2b_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2b_dwconv", "inbound_nodes": [[["block2b_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_bn", "inbound_nodes": [[["block2b_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2b_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2b_activation", "inbound_nodes": [[["block2b_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2b_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block2b_se_squeeze", "inbound_nodes": [[["block2b_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2b_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 240]}, "name": "block2b_se_reshape", "inbound_nodes": [[["block2b_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_se_reduce", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_se_reduce", "inbound_nodes": [[["block2b_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_se_expand", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_se_expand", "inbound_nodes": [[["block2b_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2b_se_excite", "trainable": true, "dtype": "float32"}, "name": "block2b_se_excite", "inbound_nodes": [[["block2b_activation", 0, 0, {}], ["block2b_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_project_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_project_conv", "inbound_nodes": [[["block2b_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_project_bn", "inbound_nodes": [[["block2b_project_conv", 0, 0, {}]]]}, {"class_name": "FixedDropout", "config": {"name": "block2b_drop", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block2b_drop", "inbound_nodes": [[["block2b_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2b_add", "trainable": true, "dtype": "float32"}, "name": "block2b_add", "inbound_nodes": [[["block2b_drop", 0, 0, {}], ["block2a_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2c_expand_conv", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2c_expand_conv", "inbound_nodes": [[["block2b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2c_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2c_expand_bn", "inbound_nodes": [[["block2c_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2c_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2c_expand_activation", "inbound_nodes": [[["block2c_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2c_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2c_dwconv", "inbound_nodes": [[["block2c_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2c_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2c_bn", "inbound_nodes": [[["block2c_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2c_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2c_activation", "inbound_nodes": [[["block2c_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2c_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block2c_se_squeeze", "inbound_nodes": [[["block2c_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2c_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 240]}, "name": "block2c_se_reshape", "inbound_nodes": [[["block2c_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2c_se_reduce", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2c_se_reduce", "inbound_nodes": [[["block2c_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2c_se_expand", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2c_se_expand", "inbound_nodes": [[["block2c_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2c_se_excite", "trainable": true, "dtype": "float32"}, "name": "block2c_se_excite", "inbound_nodes": [[["block2c_activation", 0, 0, {}], ["block2c_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2c_project_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2c_project_conv", "inbound_nodes": [[["block2c_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2c_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2c_project_bn", "inbound_nodes": [[["block2c_project_conv", 0, 0, {}]]]}, {"class_name": "FixedDropout", "config": {"name": "block2c_drop", "trainable": true, "dtype": "float32", "rate": 0.0625, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block2c_drop", "inbound_nodes": [[["block2c_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2c_add", "trainable": true, "dtype": "float32"}, "name": "block2c_add", "inbound_nodes": [[["block2c_drop", 0, 0, {}], ["block2b_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2d_expand_conv", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2d_expand_conv", "inbound_nodes": [[["block2c_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2d_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2d_expand_bn", "inbound_nodes": [[["block2d_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2d_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2d_expand_activation", "inbound_nodes": [[["block2d_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2d_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2d_dwconv", "inbound_nodes": [[["block2d_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2d_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2d_bn", "inbound_nodes": [[["block2d_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2d_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2d_activation", "inbound_nodes": [[["block2d_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2d_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block2d_se_squeeze", "inbound_nodes": [[["block2d_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2d_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 240]}, "name": "block2d_se_reshape", "inbound_nodes": [[["block2d_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2d_se_reduce", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2d_se_reduce", "inbound_nodes": [[["block2d_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2d_se_expand", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2d_se_expand", "inbound_nodes": [[["block2d_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2d_se_excite", "trainable": true, "dtype": "float32"}, "name": "block2d_se_excite", "inbound_nodes": [[["block2d_activation", 0, 0, {}], ["block2d_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2d_project_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2d_project_conv", "inbound_nodes": [[["block2d_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2d_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2d_project_bn", "inbound_nodes": [[["block2d_project_conv", 0, 0, {}]]]}, {"class_name": "FixedDropout", "config": {"name": "block2d_drop", "trainable": true, "dtype": "float32", "rate": 0.07500000000000001, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block2d_drop", "inbound_nodes": [[["block2d_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2d_add", "trainable": true, "dtype": "float32"}, "name": "block2d_add", "inbound_nodes": [[["block2d_drop", 0, 0, {}], ["block2c_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2e_expand_conv", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2e_expand_conv", "inbound_nodes": [[["block2d_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2e_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2e_expand_bn", "inbound_nodes": [[["block2e_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2e_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2e_expand_activation", "inbound_nodes": [[["block2e_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2e_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2e_dwconv", "inbound_nodes": [[["block2e_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2e_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2e_bn", "inbound_nodes": [[["block2e_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2e_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2e_activation", "inbound_nodes": [[["block2e_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2e_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block2e_se_squeeze", "inbound_nodes": [[["block2e_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2e_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 240]}, "name": "block2e_se_reshape", "inbound_nodes": [[["block2e_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": 